#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.main.data.archive_file.lambda_function: Reading...
module.main.data.archive_file.lambda_function: Read complete after 0s [id=966380112fc320910fd80bf456aff3d9a512764d]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.main.aws_iam_role.lambda_role has changed
  ~ resource "aws_iam_role" "lambda_role" {
      + arn                   = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-lambda-role"
        id                    = "lapwing-item-news-dev-lambda-role"
        name                  = "lapwing-item-news-dev-lambda-role"
        # (6 unchanged attributes hidden)
    }

  # module.main.aws_iam_role.scheduler_role has changed
  ~ resource "aws_iam_role" "scheduler_role" {
      + arn                   = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-scheduler-role"
        id                    = "lapwing-item-news-dev-scheduler-role"
        name                  = "lapwing-item-news-dev-scheduler-role"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.main.aws_iam_policy.scheduler_policy will be created
  + resource "aws_iam_policy" "scheduler_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lapwing-item-news-dev-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_iam_role.lambda_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "lambda_role" {
      ~ arn                   = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-lambda-role" -> (known after apply)
      ~ create_date           = "2025-10-03T19:20:52Z" -> (known after apply)
      ~ id                    = "lapwing-item-news-dev-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "lapwing-item-news-dev-lambda-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROARIS3GSWXF7PEW7V4H" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.main.aws_iam_role.scheduler_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "scheduler_role" {
      ~ arn                   = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-scheduler-role" -> (known after apply)
      ~ create_date           = "2025-10-03T19:20:52Z" -> (known after apply)
      ~ id                    = "lapwing-item-news-dev-scheduler-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "lapwing-item-news-dev-scheduler-role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROARIS3GSWXCFKNYEUFE" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.main.aws_iam_role_policy_attachment.scheduler will be created
  + resource "aws_iam_role_policy_attachment" "scheduler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-scheduler-role"
    }

  # module.main.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../../dist/out/index.zip"
      + function_name                  = "lapwing-item-news-dev-lambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "+8/Y2FWe5Ijc9tQBE/oWl8EcU8Kfm7ZUD7Adw4EJSvM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.main.aws_scheduler_schedule.invoke_lambda will be created
  + resource "aws_scheduler_schedule" "invoke_lambda" {
      + action_after_completion      = (known after apply)
      + arn                          = (known after apply)
      + group_name                   = "lapwing-item-news-dev-scheduler-group"
      + id                           = (known after apply)
      + name                         = "lapwing-item-news-dev-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "ap-northeast-1"
      + schedule_expression          = "cron(0/10 * * * ? *)"
      + schedule_expression_timezone = "Asia/Tokyo"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = (known after apply)
          + role_arn = (known after apply)

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 0
            }
        }
    }

  # module.main.aws_scheduler_schedule_group.group will be created
  + resource "aws_scheduler_schedule_group" "group" {
      + arn                    = (known after apply)
      + creation_date          = (known after apply)
      + id                     = (known after apply)
      + last_modification_date = (known after apply)
      + name                   = "lapwing-item-news-dev-scheduler-group"
      + name_prefix            = (known after apply)
      + region                 = "ap-northeast-1"
      + state                  = (known after apply)
      + tags_all               = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_ssm_parameter.twitter_access_token is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_access_token" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/AccessToken" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/AccessToken" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/AccessToken"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.twitter_access_token_secret is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_access_token_secret" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/AccessTokenSecret" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/AccessTokenSecret" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/AccessTokenSecret"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.twitter_api_key is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_api_key" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/ApiKey" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/ApiKey" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/ApiKey"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.twitter_api_secret is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_api_secret" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/ApiSecret" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/ApiSecret" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/ApiSecret"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 11 to add, 0 to change, 6 to destroy.

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment `/deploy 18232273016 ` on this PR.